
public class practice6_10 {//11,12

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//	10 : b , e
//생성자(Constructor)는 new 연산자와 같이 사용되어
//클래스로부터 객체를 생성할 때 호출되어 객체의 초기화를 담당한다. 
//인스턴스 변수의 초기화 작업에 주로 사용되며,
//인스턴스 생성 시에 실행되어야 할 작업을 위해서도 사용
		//  11 : b
//자바에서 this는 자기 자신을 말한다. ‘this.문돌’ 이라하면 
//내가 가지고 있는 문돌 필드라는 의미이다. 
//객체는 자신의 참조를 가지고 있는 키워드로 멤버임을 
//명확히 하기 위해 this를 사용한다.
		//  12 : c , d
//		자바에서 다향성을 지원하는 오버로딩/ 오버라이딩이 있습니다. 
//		오버로딩 (Overloading) : 메서드의 이름은 같고 
//		매개변수의 유형과 개수가 다르도록 하는 것을 의미합니다. 
//		- 리턴값만을 다르게 갖는 오버로딩은 작성 할 수 없습니다.
	
	}

}
